import Vue from 'vue';
import Vuex from 'vuex';
import MutationTypes from './mutation-types';

Vue.use(Vuex);

const getters = {
    favDrugsIdList: (state) => {
        return state.favDrugsList.map(el => el.id);
    },
};

const mutations = {
    [MutationTypes.DELETE_FAV_DRUG] (state, drug) {
        state.favDrugsList.splice(state.favDrugsList.indexOf(drug), 1);
    },

    [MutationTypes.START_SEARCHING] (state) {
        state.isSearching = true;
    },

    [MutationTypes.END_SEARCHING] (state) {
        state.isSearching = false;
    },

    [MutationTypes.SET_DRUG_BY_ID] (state, id) {
        const value = state.favDrugsList.find(el => el.id === id);
        Vue.set(state, 'currentDrug', value);
    },

    [MutationTypes.ADD_FAV_DRUG] (state, drug) {
        function sortedIndex (array, value) {
            let low = 0;
            let high = array.length;
            const loweredName = value.name.toLowerCase();

            while (low < high) {
                const mid = (low + high) >>> 1;
                if (array[mid].name.toLowerCase() < loweredName) low = mid + 1;
                else high = mid;
            }
            return low;
        }

        const array = state.favDrugsList;
        if (array.some(e => e.id === drug.id)) return;
        const indexToPush = sortedIndex(array, drug);

        array.splice(indexToPush, 0, drug);
    }
};

const state = {
    title: "Pharmacy",
    isSearching: false,
    currentDrug: {},
    foundDrugsList: [
        {
            id: 1,
            global_name: "Клопидогрел-Тева",
            name: "1-Зитига",
            form: "раствор для внутримышечного и подкожного введения 50 мг/мл, 5 мл - ампулы (5) - упаковки контурные пластиковые (2) -  пачки картонные",
            company: "ЗАО Бинергия - Россия;Пр.,Перв.Уп.,Втор.Уп.,Вып.к.-Федеральное Казенное Предприятие Армавирская биологическая фабрика (ФКП Армавирская биофабрика) - Россия.",
            limit_price: 369.25,
            reg_date: "21.11.2014 (717/20-14)"
        },
        {
            global_name: "Леналидомид",
            name: "Метибластан",
            form: "капсулы, 25 мг, (7) - упаковки ячейковые контурные, 3 шт. ~ / пачки картонные",
            company: "Лаборатория Тютор С.А.С.И.Ф.И.А - Аргентина;Пр.,Перв.Уп.-Лаборатория Экзане Фарма С.А. - Аргентина;Втор.Уп.,Вып.к.-Лаборатория Тютор С.А.С.И.Ф.И.А - Аргентина.",
            limit_price: 256547,
            reg_date: "27.12.2016 (20-4-4033490-сниж)",
            id: 438
        },
        {
            id: 2,
            global_name: "Димеркаптопропансульфонат натрия",
            name: "Унитиол",
            form: "раствор для внутримышечного и подкожного введения 50 мг/мл, 5 мл - ампулы  (10) /в комплекте с ножом ампульным или скарификатором ампульным/ - пачки картонные",
            company: "ООО «СтатусФарм» - Россия;Пр.,Перв.Уп.,Втор.Уп.,Вып.к.-ОАО Ереванская химико-фармацевтическая фирма - Армения.",
            limit_price: 369.2,
            reg_date: "31.10.2013 (599/20-13)"
        },
    ],
    favDrugsList: [
        {
            id: 3,
            global_name: "Димеркаптопропансульфонат натрия",
            name: "Абиратерон",
            form: "раствор для внутримышечного и подкожного введения 50 мг/мл, 5 мл - ампулы (5) - упаковки контурные пластиковые (2) -  пачки картонные",
            company: "ЗАО Бинергия - Россия;Пр.,Перв.Уп.,Втор.Уп.,Вып.к.-Федеральное Казенное Предприятие Армавирская биологическая фабрика (ФКП Армавирская биофабрика) - Россия.",
            limit_price: 369.25,
            reg_date: "25.04.2016 (20-4-4008872-изм)"
        },
        {
            global_name: "Пертузумаб+Трастузумаб [набор]",
            name: "Бейодайм",
            form: "капсулы, 25 мг, 7 шт. (7) - блистеры, 3 шт. ~ / пачки картонные",
            company: "Акционерное общество Р-Фарм - Россия;Пр.,Перв.Уп.-Рош Диагностикс ГмбХ, Германия (Перьета (пертузумаб)); Дженентек Инк., США (Герцептин (трастузумаб)); Ф.Хоффманн-Ля Рош Лтд, Швейцария (бактериостатическая вода для инъекций) - Германия/США/Швейцария;Втор.Уп.-Акционерное общество ОРТАТ                           (АО ОРТАТ) - Россия;Вып.к.-Акционерное общество ОРТАТ (АО ОРТАТ) - Россия.",
            limit_price: 292357.07,
            reg_date: "11.07.2017 (20-4-4047183-изм)",
            id: 44
        },
        {
            id: 41,
            global_name: "Клопидогрел-Тева",
            name: "Зитига",
            form: "раствор для внутримышечного и подкожного введения 50 мг/мл, 5 мл - ампулы (5) - упаковки контурные пластиковые (2) -  пачки картонные",
            company: "ЗАО Бинергия - Россия;Пр.,Перв.Уп.,Втор.Уп.,Вып.к.-Федеральное Казенное Предприятие Армавирская биологическая фабрика (ФКП Армавирская биофабрика) - Россия.",
            limit_price: 369.25,
            reg_date: "21.11.2014 (717/20-14)"
        },
        {
            global_name: "Леналидомид",
            name: "Метибластан",
            form: "капсулы, 25 мг, (7) - упаковки ячейковые контурные, 3 шт. ~ / пачки картонные",
            company: "Лаборатория Тютор С.А.С.И.Ф.И.А - Аргентина;Пр.,Перв.Уп.-Лаборатория Экзане Фарма С.А. - Аргентина;Втор.Уп.,Вып.к.-Лаборатория Тютор С.А.С.И.Ф.И.А - Аргентина.",
            limit_price: 256547,
            reg_date: "27.12.2016 (20-4-4033490-сниж)",
            id: 48
        },
        {
            id: 2,
            global_name: "Димеркаптопропансульфонат натрия",
            name: "Унитиол",
            form: "раствор для внутримышечного и подкожного введения 50 мг/мл, 5 мл - ампулы  (10) /в комплекте с ножом ампульным или скарификатором ампульным/ - пачки картонные",
            company: "ООО «СтатусФарм» - Россия;Пр.,Перв.Уп.,Втор.Уп.,Вып.к.-ОАО Ереванская химико-фармацевтическая фирма - Армения.",
            limit_price: 369.2,
            reg_date: "31.10.2013 (599/20-13)"
        },
    ]
};

const store = new Vuex.Store({
    state,
    getters,
    mutations
});

export default store
